2018-04-08_19-15-44.464050/LT-Easytravel.yml
---
execution:
  scenario: LT-Easytravel
  concurrency: 20
  ramp-up: 1m
  hold-for: 1m
scenarios:
  LT-Easytravel:
    headers:
    requests:
      - url: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/'
        method: GET
        label: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/'
        think-time: 0ms
        headers:
          Upgrade-Insecure-Requests: '1'
          Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
      - url: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/rating/ratings.php'
        method: POST
        label: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/rating/ratings.php'
        headers:
          Accept: 'application/json, text/javascript, */*; q=0.01'
          Origin: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079'
          X-Requested-With: XMLHttpRequest
          Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          Referer: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/'
        body:
          info: '1'
          journey_id: '11'
      - url: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/rating/ratings.php'
        method: POST
        label: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/rating/ratings.php'
        headers:
          Accept: 'application/json, text/javascript, */*; q=0.01'
          Origin: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079'
          X-Requested-With: XMLHttpRequest
          Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          Referer: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/'
        body:
          info: '1'
          journey_id: '11'
      - url: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/CalculateRecommendations'
        method: GET
        label: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/CalculateRecommendations'
        headers:
          Accept: 'text/html, */*; q=0.01'
          X-Requested-With: XMLHttpRequest
          Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          Referer: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/'
        body:
          _: '1523225235535'
      - url: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/amp/'
        method: GET
        label: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/amp/'
        think-time: 1608ms
        headers:
          Upgrade-Insecure-Requests: '1'
          Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          Referer: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/'
      - url: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/amp/italy/'
        method: GET
        label: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/amp/italy/'
        think-time: 4395ms
        headers:
          Upgrade-Insecure-Requests: '1'
          Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          Referer: 'http://ec2-54-84-118-207.compute-1.amazonaws.com:8079/amp/'
services:
- module: passfail
  criteria:
  - avg-rt>50ms for 10s, stop as failed
  - hits of reserve >100 for 10s, continue as failed
reporting:
- module: junit-xml
  filename: /var/lib/jenkins/workspace/Taurus-Jenkins-ServiceNow-Demo/junit-report.xml
  data-source: pass-fail